Tekla Open API Reference for Tekla Structures 2025
StringConverter.CanConvertFrom Method
 Checks whether the conversion can be made from the source type to the string datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool CanConvertFrom(
	ITypeDescriptorContext context,
	Type sourceType
)
Public Overrides Function CanConvertFrom (
	context As ITypeDescriptorContext,
	sourceType As Type
) As Boolean
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
The context.
sourceType
Type: System.Type
The type to convert from.
Return Value
Type: Boolean
True if possible, false if not possible.
See Also
Reference
StringConverter Class
Tekla.Structures.Datatype Namespace